mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
static const char ESP8266_FIREBASE_STR_164[] PROGMEM = "get";
static const char ESP8266_FIREBASE_STR_165[] PROGMEM = "set";
static const char ESP8266_FIREBASE_STR_166[] PROGMEM = "push";
static const char ESP8266_FIREBASE_STR_167[] PROGMEM = "update";
static const char ESP8266_FIREBASE_STR_168[] PROGMEM = "delete";

static const char ESP8266_FIREBASE_STR_169[] PROGMEM = "{";
static const char ESP8266_FIREBASE_STR_170[] PROGMEM = "%d";
static const char ESP8266_FIREBASE_STR_171[] PROGMEM = "%f";
static const char ESP8266_FIREBASE_STR_172[] PROGMEM = "[";
static const char ESP8266_FIREBASE_STR_173[] PROGMEM = "]";
static const char ESP8266_FIREBASE_STR_174[] PROGMEM = "array";
static const char ESP8266_FIREBASE_STR_175[] PROGMEM = "unknown";
static const char ESP8266_FIREBASE_STR_176[] PROGMEM = "pool.ntp.org";
static const char ESP8266_FIREBASE_STR_177[] PROGMEM = "time.nist.gov";

static const unsigned char ESP8266_FIREBASE_base64_table[65] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

class FirebaseData;
class StreamData;
class QueueInfo;
class FirebaseESP8266;
class FCMObject;



typedef std::function<void(void)> callback_function_t;

static std::vector<std::reference_wrapper<FirebaseData>> firebaseDataObject;
static uint8_t dataObjectIndex __attribute__((used)) = 0;

class FCMObject
{
public:
  FCMObject();
  ~FCMObject();

  /*
    Store Firebase Cloud Messaging's authentication credentials.
    
    @param serverKey - Server key found on Console: Project settings > Cloud Messaging

   */
  void begin(const String &serverKey);

  /*
    Add recipient's device registration token or instant ID token.
    
    @param deviceToken - Recipient's device registration token to add that message will be sent to.

   */
  void addDeviceToken(const String &deviceToken);

  /*
    Remove the recipient's device registration token or instant ID token.
    
    @param index - Index (start from zero) of the recipient's device registration token that added to FCM Data Object of Firebase Data object.

   */
  void removeDeviceToken(uint16_t index);

  /*
    Clear all recipient's device registration tokens.
    
  */
  void clearDeviceToken();

  /*
    Set the notify message type information.
    
    @param title - The title text of notification message.
    @param body - The body text of notification message.

   */
  void setNotifyMessage(const String &title, const String &body);

  /*
    Set the notify message type information.
    
    @param title - The title text of notification message.
    @param body - The body text of notification message.
    @param icon - The name and/or included URI/URL of the icon to show on notifying the message.

   */
  void setNotifyMessage(const String &title, const String &body, const String &icon);

  /*
    Set the notify message type information.
    
    @param title - The title text of notification message.
    @param body - The body text of notification message.
    @param icon - The name and/or included URI/URL of the icon to show on notifying the message.
    @param click_action - The URL or intent to accept click event on the notification message.

   */
  void setNotifyMessage(const String &title, const String &body, const String &icon, const String &click_action);

  /*
    Clear all notify message information.
    
  */
  void clearNotifyMessage();

  /*
    Set the custom data message type information.
    
    @param jsonString - The JSON structured data string.

  */
  void setDataMessage(const String &jsonString);

  /*
    Set the custom data message type information.
    
    @param json - The FirebaseJson object.

  */
  void setDataMessage(FirebaseJson &json);

  /*
    Clear custom data message type information.
    
  */
  void clearDataMessage();

  /*
    Set the priority of the message (notification and custom data).
    
    @param priority - The priority string i.e. normal and high.

  */
  void setPriority(const String &priority);

  /*
    Set the collapse key of the message (notification and custom data).
    
    @param key - String of collapse key.

  */
  void setCollapseKey(const String &key);

  /*
    Set the Time To Live of the message (notification and custom data).
    
    @param seconds - Number of seconds from 0 to 2,419,200 (4 weeks).

  */
  void setTimeToLive(uint32_t seconds);

  /*
    Set the topic of the message which will be sent to.
    
    @param topic - Topic string.

  */
  void setTopic(const String &topic);

  /*
    Get the send result.
    
    @return String of payload returned from the server.

  */
  String getSendResult();

  friend FirebaseESP8266;
  friend FirebaseData;

private:
  bool fcm_connect(FirebaseHTTPClient &net);
  bool fcm_send(FirebaseHTTPClient &net, int &httpcode, uint8_t messageType);
  void fcm_buildHeader(char *header, size_t payloadSize);
  void fcm_buildPayload(char *msg, uint8_t messageType);
  bool getFCMServerResponse(FirebaseHTTPClient &net, int &httpcode);
  void clear();
  void strcat_c(char *str, char c);
  int strpos(const char *haystack, const char *needle, int offset);

  std::string _notify_title = "";
  std::string _notify_body = "";
  std::string _notify_icon = "";
  std::string _notify_click_action = "";
  std::string _data_msg = "";
  std::string _priority = "";
  std::string _collapse_key = "";
  std::string _topic = "";
  std::string _server_key = "";
  std::string _sendResult = "";
  int _ttl = -1;
  uint16_t _index = 0;
  uint16_t _port = 443;
  std::vector<std::string> _deviceToken;
};

class QueryFilter
{
public:
  QueryFilter();
  ~QueryFilter();
  QueryFilter &orderBy(const String &);
  QueryFilter &limitToFirst(int);
  QueryFilter &limitToLast(int);
  QueryFilter &startAt(float);
  QueryFilter &endAt(float);
  QueryFilter &startAt(const String &);
  QueryFilter &endAt(const String &);
  QueryFilter &equalTo(int);
  QueryFilter &equalTo(const String &);
  QueryFilter &clear();
  friend FirebaseESP8266;
  friend FirebaseData;

protected:
  std::string _orderBy = "";
  std::string _limitToFirst = "";
  std::string _limitToLast = "";
  std::string _startAt = "";
  std::string _endAt = "";
  std::string _equalTo = "";
};

